/**
 * Created by mali on 2016/6/6.
 */
FM.dataApi.Constant = {
    'PARKING_TYPE': {
        0: "室内",
        1: "室外",
        2: "占道",
        3: "室内(地上)",
        4: "室内(地下)"
    },
    'TOLLSTD': {
        "0": "包年",
        "1": "包月",
        "2": "计次",
        "3": "计时",
        "4": "分段计价",
        "5": "免费"
    },
    'TOLLWAY': {
        "0": "手工收费",
        "1": "电子收费",
        "2": "自助缴费"
    },
    'remark_ml': {
        0: "无条件免费",
        1: "住宿免费",
        2: "就餐免费",
        3: "购物免费",
        4: "购物或就餐满额免部分费用",
        5: "和停车场所在主体POI产生消费、办事、就诊等关系时免费",
        6: "只对内或者产生消费的群体开放",
        7: "汽车美容"
    },
    'remark_hm': {
        11: "搭升降機",
        12: "祗限訪客",
        13: "祗停貨車",
        14: "30 分鐘免費",
        15: "電動車充電",
        16: "留匙",
        17: "洗車及打蠟"
    },
    'RETING': {
        0: "未调查",
        1: "其他",
        3: "三星级",
        4: "四星级",
        5: "五星级",
        6: "超五星级",
        7: "一星级",
        8: "二星级",
        13: "准三星级",
        14: "准四星级",
        15: "准五星级",
        16: "准一星级",
        17: "准二星级"
    },
    'CREDIT_CARD':{
        0: "不支持信用卡",
        1: "维士(visa)",
        2: "万事达(mastercard)",
        3: "大来(dinas)",
        4: "日本国际信用卡(jcb)",
        5: "美 国 运 通 (AmericaExpress)",
        6: "银联(unionpay)"
    },
    'payment_ml': {
        0: "现金",
        1: "借记卡",
        2: "信用卡",
        3: "储值卡"
    },
    'payment_hm': {
        10: "八達通",
        11: "VISA",
        12: "MasterCard",
        13: "現金",
        14: "其他"
    },
    service_ml: {
        1: "便利店",
        2: "洗车",
        3: "汽车维修",
        4: "卫生间",
        5: "餐饮",
        6: "住宿",
        7: "换油",
        8: "自助加油"
    },
    service_hm: {
        11: "換油服務Lube Service",
        12: "洗車服務Car Wash",
        13: "便利店Convenience Store",
        14: "廁所Toilet"
    },
    oilType: {
        "0": "其他",
        "89": "89号汽油",
        "90": "90号汽油",
        "92": "92号汽油",
        "93": "93号汽油",
        "95": "95号汽油",
        "97": "97号汽油",
        "98": "98号汽油"
    },
    mgType: {
        "0": "其他",
        "M5": "M5号汽油",
        "M10": "M10号汽油",
        "M15": "M15号汽油",
        "M30": "M30号汽油",
        "M50": "M50号汽油",
        "M85": "M85号汽油",
        "M100": "M100号汽油",
    },
    egType: {
        "0": "其他",
        "E90": "E90号汽油",
        "E92": "E92号汽油",
        "E93": "E93号汽油",
        "E95": "E95号汽油",
        "E97": "E97号汽油",
        "E98": "E98号汽油",
    },
    // fuelType_ml: {
    //     "0": "柴油",
    //     "8": "生物柴油"
    // },
    fuelType_ml: {
        0: "柴油(Diesel)",
        1: "汽油(Gasoline)",
        2: "甲醇汽油(MG85)",
        3: "其它",
        4: "液化石油气(LPG)",
        5: "天然气(CNG)",
        6: "乙醇汽油(E10)",
        7: "氢燃料(Hydrogen)",
        8: "生物柴油(Biodiesel)",
        9: "液化天然气(LNG)"
    },
    fuelType_hm: {
        11: "SINO X Power",
        12: "SINO Power",
        13: "SINO Disel",
        21: "力勁柴油",
        22: "清新汽油",
        23: "超級汽油",
        31: "Gold黄金",
        32: "Platinum白金",
        33: "Diesel特配柴油",
        34: "柴油现金咭",
        41: "Disel超低硫柴油",
        42: "8000電油",
        43: "F-1特級電油",
        51: "Disesel柴油",
        52: "FuelSave慳油配方汽油",
        53: "Shell V-Power",
        61: "超勁慳油配方汽油",
        62: "清潔配方低硫柴油"
    },
    // fuelType_ml: {
    //     3: "其他",
    //     4: "液化石油气",
    //     5: "天然气",
    //     7: "氢燃料",
    //     //        8: "生物柴油",
    //     9: "液化天然气"
    // },
    // fuelType_hm: {
    //     14: "LPG",
    //     24: "LPG",
    //     35: "AutoGas石油氣",
    //     44: "AutoGas石油氣",
    //     54: "AutoGas石油氣"
    // },
    sportsVenuesBuildingType: {
        0: "室内",
        1: "室外"
    }

}
