/**
 * Created by mali on 2016/6/6.
 */
FM.dataApi.Constant = {
    'PARKING_TYPE': {
        0: "室内",
        1: "室外",
        2: "占道",
        3: "室内(地上)",
        4: "室内(地下)"
    },
    'TOLLSTD': {
        "0": "包年",
        "1": "包月",
        "2": "计次",
        "3": "计时",
        "4": "分段计价",
        "5": "免费"
    },
    'TOLLWAY': {
        "0": "手工收费",
        "1": "电子收费",
        "2": "自助缴费"
    },
    'remark_ml': {
        0: "无条件免费",
        1: "住宿免费",
        2: "就餐免费",
        3: "购物免费",
        4: "购物或就餐满额免部分费用",
        5: "和停车场所在主体POI产生消费、办事、就诊等关系时免费",
        6: "只对内或者产生消费的群体开放",
        7: "汽车美容"
    },
    'remark_hm': {
        11: "搭升降機",
        12: "祗限訪客",
        13: "祗停貨車",
        14: "30 分鐘免費",
        15: "電動車充電",
        16: "留匙",
        17: "洗車及打蠟"
    }
}
